Tekla.Structures.ModelInternal.DoubleList
The DoubleList class defines a type safe list of doubles.
The following example adds some doubles to the list and calculates the sum of them:
using Tekla.Structures.ModelInternal;
public class Example
{
public void Example1()
{
double Sum = 0;
DoubleList MyDoubleList = new DoubleList();
MyDoubleList.Add(1.5);
MyDoubleList.Add(3.1);
MyDoubleList.Add(5.2);
foreach(double MyDouble in MyDoubleList)
{
Sum += MyDouble;
}
}
}

Tekla.Structures.ModelInternal.DoubleList.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.DoubleList class.

Tekla.Structures.ModelInternal.DoubleList.#ctor(System.Collections.IEnumerable)
Initializes a new instance of the Tekla.Structures.ModelInternal.DoubleList class.
doubles: An IEnumberable of doubles. All the objects must be double's.

Tekla.Structures.ModelInternal.DoubleList.Item(System.Int32)
Gets or sets the double at the specified index.
index: The zero-based index of the element to get or set.
Returns: The double value at this index.

Tekla.Structures.ModelInternal.DoubleList.Add(System.Double)
Adds a new double to the end of the double list.
value: The double to be added to the list.
Returns: The index where the double was added.

Tekla.Structures.ModelInternal.DoubleList.Contains(System.Double)
Checks if the given double is in the list.
value: The double to be checked.
Returns: True if the double is in the list, otherwise false.

Tekla.Structures.ModelInternal.DoubleList.IndexOf(System.Double)
Gets the index of the specified double.
value: The double to locate in the list.
Returns: The index of the double if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.DoubleList.IndexOf(System.Double,System.Int32)
Gets the index of the specified double between the index to start
the search from and the end of the list.
value: The double to locate in the list.
startIndex: The index to start the search from.
Returns: The index of the double if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.DoubleList.IndexOf(System.Double,System.Int32,System.Int32)
Gets the index of the specified double between the index to start the search from and StartIndex + Count.
value: The double to locate in the list.
startIndex: The index to start the search from.
count: The number of items searched.
Returns: The index of the double if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.DoubleList.Insert(System.Int32,System.Double)
Inserts the double to the specified index.
index: The index where the double is inserted.
value: The double to be inserted.

Tekla.Structures.ModelInternal.DoubleList.GetRange(System.Int32,System.Int32)
Gets a sub-list of the double list.
index: The start index of the new list.
count: The number of items in the new list.
Returns: The new double list.

Tekla.Structures.ModelInternal.DoubleList.LastIndexOf(System.Double)
Searches for the last occurence of the double in the list.
value: The double to locate.
Returns: The last index of the double if found, otherwise -1.

Tekla.Structures.ModelInternal.DoubleList.LastIndexOf(System.Double,System.Int32)
Searches for the last occurence of the double in the list.
value: The double to locate.
startIndex: The index to start the search from.
Returns: The last index of the double if found, otherwise -1.

Tekla.Structures.ModelInternal.DoubleList.LastIndexOf(System.Double,System.Int32,System.Int32)
Searches for the last occurence of the double in the list.
value: The double to locate.
startIndex: The index to start the search from.
count: The number of items searched.
Returns: The last index of the double if found, otherwise -1.

Tekla.Structures.ModelInternal.DoubleList.Remove(System.Double)
Removes the first occurence of the double from the list.
value: The double to be removed.

Tekla.Structures.ModelInternal.DoubleList.RemoveRange(System.Int32,System.Int32)
Removes a range of items starting from the given index.
index: The start index.
count: The number of items to be removed.

Tekla.Structures.ModelInternal.DoubleList.ToArray
Copies the doubles to an double array.
Returns: The array of doubles.

Tekla.Structures.ModelInternal.DoubleList.IsEqual(System.Object)
Compares the current object with an object of the same type.
objectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.